//                                          Котроль версий GIT!

//https://habr.com/ru/company/ruvds/blog/599929/ - команды GIT!

//Первая команда, для того, что б репозирторий GIT следил за проектом - git init.
//Вторая команда знакомства - git config --local user.name 'Vladimir' 
//                            git config --local user.email cremneffv@gmail.com.
//Так же если мы поменяем с local(за конкретным проектом) на global, будет глобальная слежка, за всеми проектами на ПК!
//Проверить статус - git status!
//Добавить в индекс, что бы он их сохранил и в дальнейшем использовал, что б сохранить верссию(commit) - git add -A.
//Что б сохранитть определенный файл, можно указать вместо "-А - All - все файлы" - определнный файл!
//А что бы добавить файлы с определенным классом, нужно добавить "*js, html, css"!
//Что бы привести в третье состояние, "commit" - нужно ввести git commit -a -m(massage - описание коммита)"first commit"
//создаем удаленный репозиторий!(команды на сайте GIT)
//Клонируем репозиторий из GIT (git clone).
//git pull - добавить изменения к проекту!(Всегда догружать на ПК проект!!).
//Если идет рассинхронизация с локальными файлами и удаленными на устройстве, нужно: догрузить данные с удаленного,
// потом добавить комментарий и 2 раза нажать на "ctr + C", после этого ввести команду ":wq!" и нажать "enter"! 
//marge - слияние локальных и удаленных файлов!